let testArry = [];

const myArray = [
  "לדבר עם רבעיית ההגנה",
  "אני מדבר",
  "מעודד ומכוון את ההגנה כל הזמן",
  "אני מייצר תקשורת עם השחקנים",
  "אני שולט בקצב המשחק",
  "אני מחדש מהר התקפות",
  "אני עוצר ונותן לקבוצה לנשום כשצריך",
  "אני שומר על חום גוף",
  "עיניים על הכדור",
  "יוצא לכדור גובה בביטחון",
  "אומר לעצמי את מילת הקוד שלי",
  "אני דינמי גם כשהקבוצה שלי תוקפת",
  "מתאושש מהר אחרי טעויות",
  "עושה NEXT מהיר אחרי טעות",
  "עושה NEXT מהיר וחוזר לעמדה שלי",
  "עושה NEXT מהיר ורודף להחזיר את הכדור",
  "עושה NEXT מהיר ומחפש את ההזדמנות הבאה",
  "הניסיון זה הניצחון שלי",
  "אני מאיים לשער גם מחצי מצב",
  "אני אוסף את השחקנים לפני פתיחת המשחק לשיחה",
  "אני אוסף את קו ההגנה לפני פתיחת המשחק לשיחה",
  "אני קרוב לחלוץ שלי מפריע לו, עושה לו חיים קשים. הוא מרגיש אותי.",
  "אני דוחף את קו ההגנה כשהפער עם הקישור גדל",
  "אני מדבר ומכוון את ההגנה והקישור לאורך כל המשחק",
  "עולה חזק ומתאבד על כל כדור גובה באיזור שלי",
  "כשהכדור מגיע לכנף, אני עושה לו עקיפה ומבקש את הכדור",
  "אני עושה תנועות עומק ונכנס בגב של המגן היריב.",
  "כשאני מגיע למצב הרמה, אני מרים ראש ומחפש שחקנים ברחבה",
  "עושה סוויצ' מהיר וחוזר לעמדה אחרי התקפה.",
  "אני תוקף את היריב בכל פעם שהוא מקבל כדור",
  "אני מדבר ומעודד את הקבוצה לאורך כל המשחק ובכל תוצאה",
  "אני יורד לקחת כדור מהבלמים ומנהל את המשחק מאחורה.",
  "אני נכנס חזק עד הסוף לכל תאקל על הדשא ובגובה",
  "אני סורק את השטח ומרים ראש לפני קבלת כדור ולפני מסירה",
  "אני מניע כדור מהר מהאמצע לכנפיים.",
  "אני מדבר ומכווין שחקנים כמו זוג עיניים נוספות: ״סתובב״, ״אתה פנוי״, ״תיזהר״, ״הוא פנוי״.",
  "ברגעים שהקבוצה צריכה אותי אני דורש מעצמי לרוץ יותר",
  "אני מבקש כדור תמיד: צועק ״על אמת״ ולא מתחבא",
  "אני רץ לשטח פנוי ולאזור המסוכן.",
  "אני נותן 4 מסירות מקדמות במהלך המשחק (וממשיך גם אם לא הגיעו לכתובת)",
  "אם המסירה המקדמת לא הצליחה אני עושה NEXT ומחפש לתת עוד מסירה",
  "אני פותח את המגרש ומשחק עם רגל על הקו",
  "אני מתמקד בהטעיה אחת שאני עושה קבוע בשכונה",
  "אחרי איבוד אני מיד רץ להחזיר את הכדור.",
  "אני ממשיך לנסות פעולות יצירתיות ומוכן להיכשל כי זו הדרך היחידה להצליח",
  "אני עושה 3 תנועות עומק בין הבלמים וצועק לפני לקשרים למצוא אותי",
  "כשהכדור מגיע לכנף אני מקשיב לתחושת בטן ורץ לאיפה שאני מרגיש לנכון",
  "אני מפעיל לחץ על הבלמים",
  "אם מרגיש שלא במשחק יורד מדרגה לקבל כדור מהקשר",
];

const dataForDB = myArray.map((item) => {
  return {
    actionName: item,
    positions: [
      {
        value: "GK",
        label: "שוער",
      },
      {
        value: "CB",
        label: "בלם",
      },
      {
        value: "LB",
        label: "מגן שמאלי",
      },
      {
        value: "RB",
        label: "מגן ימני",
      },
      {
        value: "LWB",
        label: "מגן שמאלי תוקף",
      },
      {
        value: "RWB",
        label: "מגן ימני תוקף",
      },
      {
        value: "CDM",
        label: "קשר אחורי",
      },
      {
        value: "CM",
        label: "קשר מרכזי",
      },
      {
        value: "CAM",
        label: "קשר התקפי",
      },
      {
        value: "LM",
        label: "קשר שמאלי",
      },
      {
        value: "LW",
        label: "קיצוני שמאלי",
      },
      {
        value: "RW",
        label: "קיצוני ימני",
      },
      {
        value: "CF",
        label: "חלוץ מרכזי",
      },
      {
        value: "ST",
        label: "חלוץ",
      },
    ],
    measurable: true,
    trainingCompatible: true,
  };
});

// Action.insertMany(dataForDB)
//   .then((res) => {
//     console.log(res);
//   })
//   .catch((err) => {
//     console.log(err);
//   });
